wegam/STM32F1xWorkSpace/Examples/HC/PL012V11LCD.C
/******************** (C) COPYRIGHT 2008 STMicroelectronics ********************
* File Name          : PC001V21.c
* Author             : WOW
* Version            : V2.0.1
* Date               : 06/26/2017
* Description        : PC001V21层控制板.
********************************************************************************
* THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
* WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE TIME.
* AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY DIRECT,
* INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING FROM THE
* CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE CODING
* INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
*******************************************************************************/

#ifdef PL012V11LCD				//拆零柜LCD板--ILI9326测试

#include "PL012V11LCD.H"


#define	USE_R61509V
#define	USE_ILI9326

#ifdef	USE_R61509V
	#include "R61509V.h"
	R61509V_Pindef R61509V;
#else

	#include "ILI9326.h"
	sLCD_def sLCD;
#endif

#include "CS5530.H"

#include "GT32L32M0180.H"
#include "STM32F10x_BitBand.H"
#include "STM32_GPIO.H"
#include "STM32_SYS.H"
#include "STM32_SYSTICK.H"
#include "STM32_WDG.H"
#include "STM32_PWM.H"
#include "STM32_USART.H"


#include "SWITCHID.H"

#include "string.h"				//串和内存操作函数头文件
#include "stm32f10x_dma.h"

u16	DelayTime=0x1000;
u16	LCDTime=0;
u16	DSPTime=0;
u32 testADC=0;
u32 bacADC=0;
u32 bacADC2=0;

u16 ADC_dotx=0;
u16 ADC_doty=0;
u16 ADC_dotx1=0;
u16 ADC_doty1=0;

u16 SumFed[8]={0};		//总共已发药数量
u16	SumFQ[8]={0};			//总共发药请求数量
u8	NumFW=0;		//待发药槽位
u8	Onlinede=0;		//待发药槽位



GT32L32_Info_TypeDef 	GT32L32_Info;
u32 CS5530_ADC_Value=0xFFFFFFFF;
t_Point point;
u8 zimo[720]="R61509V_DrawRectangle(11,11,229,389,0X07FF)";

RS485_TypeDef  RS485;
u8 RS485FLG	=	0;
u32 RS485Time	=	0;
u32 RSRLen	=	0;

u8 TxdBuffe[256]={0};
u8 RxdBuffe[256]={0};
u8 RevBuffe[256]={0};
u16 RxNum=0;
char	Char_Buffer[256]={0xFF};		//记录format内码
//t_LcdCfg **pLcdpara;


SWITCHID_CONF	SWITCHID;
u8 SwitchID=0;	//拔码开关地址


CS5530_Pindef CS5530;


u32 Tedata	=	0;

/*******************************************************************************
* 函数名		:	
* 功能描述	:	 
* 输入		:	
* 输出		:
* 返回 		:
*******************************************************************************/
void PL012V11LCD_Configuration(void)
{
	SYS_Configuration();					//系统配置---打开系统时钟 STM32_SYS.H
	
	GPIO_DeInitAll();							//将所有的GPIO关闭----V20170605
	
	
	
	
	
	GT32L32_Configuration();
	
	LCD_Configuration();
	
//	CS5530_Configuration();
	
	RS485_Configuration();
//	PWM_OUT(TIM3,PWM_OUTChannel3,500,200);		//PWM设定-20161127版本--背光
	LCD_PowerUp();
	
	SwitchID_Configuration();
	
	
	SysTick_Configuration(1000);	//系统嘀嗒时钟配置72MHz,单位为uS
	
//	IWDG_Configuration(1000);			//独立看门狗配置---参数单位ms	
	PWM_OUT(TIM2,PWM_OUTChannel1,1,900);	//PWM设定-20161127版本--指示灯
	PWM_OUT(TIM3,PWM_OUTChannel3,1000,500);		//PWM设定-20161127版本--背光
	memset(TxdBuffe,0xA5,128);
//	ILI9326_DrawHLine( 100, 300, 100, 100 );
}
/*******************************************************************************
* 函数名		:	
* 功能描述	:	 
* 输入		:	
* 输出		:
* 返回 		:
*******************************************************************************/
void PL012V11LCD_Server(void)
{	
	IWDG_Feed();								//独立看门狗喂狗
	
//	RS485_Server();		//通讯测试
	if(DelayTime++>=100)
	{
		DelayTime	=	0;
		if(Tedata++>10000)
		{
			Tedata	=	0;
		}
		PL010V13_PrintfString(0		,128	,32	,"%0.4d",Tedata);				//待发药槽位，后边的省略号就是可变参数
	}
	if(LCDTime++>=2000)
	{
		LCDTime	=	0;
//		R61509V_Clean(R61509V_BLACK); 					//清除屏幕函数
//		LCD_Display();
	}
//	SwitchID_Server();
	
	
	 
//	if(LCDTime==500)
//	{
//		PL010V13_PrintfString(0		,134+50+16	,16	,"发药层控制器通信异常！！！！");				//错误状态
//	}
//	else if(LCDTime==1000)
//	{
//		PL010V13_PrintfString(0		,134+50+16	,16	,"XXXXXXXXXXXXXXXXXXXXXXXXXX");				//错误状态
//	}	

	
#if 0
	if(DelayTime==0)
	{
		
		DelayTime=0;
		CS5530_ADC_Value=CS5530_ReadData(&CS5530);	//读取AD值，如果返回0xFFFFFFFF,则未读取到24位AD值
//		R61509V_Clean(R61509V_BLACK); 					//清除屏幕函数
//		R61509V_ShowEn(0,0,CS5530_ADC_Value);
//		PL010V13_PrintfString(0		,0	,16	,"%2d",SwitchID);				//待发药槽位，后边的省略号就是可变参数
		PL010V13_PrintfString(120		,100	,32	,"%8d",CS5530_ADC_Value);				//待发药槽位，后边的省略号就是可变参数
	}
#endif
//	if(LCDTime==1)
//	ILI9326_Clean(ILI9326_RED);			//清除屏幕函数------
//	else if(LCDTime==1000)
//	ILI9326_Clean(ILI9326_GREEN);			//清除屏幕函数------
//	else if(LCDTime==200)
//	ILI9326_Clean(ILI9326_BLUE);			//清除屏幕函数------
//	else if(LCDTime==300)
//	ILI9326_Clean(ILI9326_BRED);			//清除屏幕函数------
//	else if(LCDTime==400)
//	ILI9326_Clean(ILI9326_GRED);			//清除屏幕函数------
//	else if(LCDTime==500)
//	ILI9326_Clean(ILI9326_GBLUE);			//清除屏幕函数------
//	else if(LCDTime==600)
//	ILI9326_Clean(ILI9326_RED);			//清除屏幕函数------
//	else if(LCDTime==700)
//	ILI9326_Clean(ILI9326_MAGENTA);			//清除屏幕函数------
//	else if(LCDTime==800)
//	ILI9326_Clean(ILI9326_GREEN);			//清除屏幕函数------
//	else if(LCDTime==900)
//	ILI9326_Clean(ILI9326_CYAN);			//清除屏幕函数------
//	else if(LCDTime==11)
//	ILI9326_Clean(ILI9326_YELLOW);			//清除屏幕函数------
//	else if(LCDTime==12)
//	ILI9326_Clean(ILI9326_BROWN);			//清除屏幕函数------
//	else if(LCDTime==13)
//	ILI9326_Clean(ILI9326_BRRED);			//清除屏幕函数------
//	else if(LCDTime==14)
//	ILI9326_Clean(ILI9326_GRAY);			//清除屏幕函数------

}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void RS485_Server(void)
{
#if 0
	RxNum=RS485_ReadBufferIDLE(&RS485,(u32*)RevBuffe,(u32*)RxdBuffe);	//串口空闲模式读串口接收缓冲区，如果有数据，将数据拷贝到RevBuffer,并返回接收到的数据个数，然后重新将接收缓冲区地址指向RxdBuffer
	if(RxNum	==	100)
	{
		RS485Time	=	0;
		PWM_OUT(TIM3,PWM_OUTChannel3,500,800);		//PWM设定-20161127版本--背光
	}
	if(RS485Time++>=1000)
	{
		RS485Time	=	0;
		RS485_DMASend(&RS485,(u32*)TxdBuffe,100);	//RS485-DMA发送程序
		PWM_OUT(TIM3,PWM_OUTChannel3,500,1);		//PWM设定-20161127版本--背光
	}
#else
	RxNum=RS485_ReadBufferIDLE(&RS485,(u32*)RevBuffe,(u32*)RxdBuffe);	//串口空闲模式读串口接收缓冲区，如果有数据，将数据拷贝到RevBuffer,并返回接收到的数据个数，然后重新将接收缓冲区地址指向RxdBuffer
	if(RxNum)
	{
		RS485Time	=	0;
		RS485FLG	=	1;
		RSRLen	=	RxNum;
		RS485_DMASend(&RS485,(u32*)RevBuffe,100);	//RS485-DMA发送程序
		PWM_OUT(TIM3,PWM_OUTChannel3,500,800);		//PWM设定-20161127版本--背光
	}
	if(RS485FLG	==	1)
	{
		if(RS485Time++>=500)
		{
			RS485Time	=	0;
			RS485_DMASend(&RS485,(u32*)RevBuffe,RSRLen);	//RS485-DMA发送程序
			RSRLen	=	0;
			RS485FLG	=	0;
			PWM_OUT(TIM3,PWM_OUTChannel3,500,1);		//PWM设定-20161127版本--背光
		}
	}
	
#endif
}

