wegam/STM32F1xWorkSpace/Examples/HC/PL012V11LCD.C
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void SwitchID_Configuration(void)
{
	SWITCHID.NumOfSW	=	8;
	
	SWITCHID.SW1_PORT	=	GPIOD;
	SWITCHID.SW1_Pin	=	GPIO_Pin_2;
	
	SWITCHID.SW2_PORT	=	GPIOA;
	SWITCHID.SW2_Pin	=	GPIO_Pin_15;
	
	SWITCHID.SW3_PORT	=	GPIOA;
	SWITCHID.SW3_Pin	=	GPIO_Pin_12;
	
	SWITCHID.SW4_PORT	=	GPIOA;
	SWITCHID.SW4_Pin	=	GPIO_Pin_11;
	
	SWITCHID.SW5_PORT	=	GPIOA;
	SWITCHID.SW5_Pin	=	GPIO_Pin_8;
	
	SWITCHID.SW6_PORT	=	GPIOB;
	SWITCHID.SW6_Pin	=	GPIO_Pin_15;
	
	SWITCHID.SW7_PORT	=	GPIOB;
	SWITCHID.SW7_Pin	=	GPIO_Pin_14;
	
	SWITCHID.SW8_PORT	=	GPIOB;
	SWITCHID.SW8_Pin	=	GPIO_Pin_13;
	
	SwitchIdInitialize(&SWITCHID);							//
	
//	SwitchID	=	SWITCHID_Read(&SWITCHID);		//
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void SwitchID_Server(void)
{
	u8 temp=0;	//拔码开关临时地址
	temp	=	SWITCHID_Read(&SWITCHID);		//读取地址
	if(SwitchID	!=	temp)
	{
		u8 AddrH	=	0,AddrL	=	0;
		u32	w=0,n=0,d=0;
//	w	=	1;n	=	0;
//	PL010V13_PrintfString(n		,0	,16	,"%2d",w);				//待发药槽位，后边的省略号就是可变参数
//	w	+=	1;n	+=	8;
//	PL010V13_PrintfString(n		,0	,16	,"%2d",w);				//待发药槽位，后边的省略号就是可变参数
//	w	+=	1;n	+=	8;
//	PL010V13_PrintfString(n		,0	,16	,"%2d",w);				//待发药槽位，后边的省略号就是可变参数
//	w	+=	1;n	+=	8;
//	PL010V13_PrintfString(n		,0	,16	,"%2d",w);				//待发药槽位，后边的省略号就是可变参数
//	w	+=	1;n	+=	8;
//	PL010V13_PrintfString(n		,0	,16	,"%2d",w);				//待发药槽位，后边的省略号就是可变参数
//	w	+=	1;n	+=	8;
//	PL010V13_PrintfString(n		,0	,16	,"%2d",w);				//待发药槽位，后边的省略号就是可变参数
//	w	+=	1;n	+=	8;
//	PL010V13_PrintfString(n		,0	,16	,"%2d",w);				//待发药槽位，后边的省略号就是可变参数
//	w	+=	1;n	+=	8;
//	PL010V13_PrintfString(n		,0	,16	,"%2d",w);				//待发药槽位，后边的省略号就是可变参数
		
		w	=	12345678;
		PL010V13_PrintfString(0		,0	,32	,"序号：");				//待发药槽位，后边的省略号就是可变参数
		PL010V13_PrintfString(0		,32	,32	,"拔码：");				//待发药槽位，后边的省略号就是可变参数
		PL010V13_PrintfString(96	,0	,32	,"%8d",w);				//待发药槽位，后边的省略号就是可变参数
		w	=	0;
		SwitchID	=	temp;
		for(n=0;n<8;n++)
		{
			if((temp&0x01)	==0x01)
			{
				d	=	1;
			}
			else
			{
				d	=	0;
			}
			temp>>=1;
			PL010V13_PrintfString(n*16+96		,32	,32	,"%d",d);				//待发药槽位，后边的省略号就是可变参数
		}
		AddrH	=	(SwitchID>>4)&0x0F;
		AddrL	=	(SwitchID>>0)&0x0F;
		PL010V13_PrintfString(0		,64	,32	,"层%0.2d，位%0.2d",AddrH,AddrL);				//待发药槽位，后边的省略号就是可变参数
	}
}

/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void GT32L32_Configuration(void)
{
	GT32L32_Info.GT32L32_Port.sSPIx=SPI1;
	GT32L32_Info.GT32L32_Port.sGT32L32_CS_PORT=GPIOA;
	GT32L32_Info.GT32L32_Port.sGT32L32_CS_PIN=GPIO_Pin_4;
	GT32L32_Info.GT32L32_Port.SPI_BaudRatePrescaler_x=SPI_BaudRatePrescaler_128;
	
	GT32L32_ConfigurationNR(&GT32L32_Info);				//普通SPI通讯方式配置
	
	GPIO_Configuration_OPP50	(GPIOA,GPIO_Pin_4);			//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度50MHz----V20170605
}


/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void LCD_Configuration(void)
{
#ifdef USE_R61509V
	unsigned long	LCDTime	=	0xFFFFFF;
	u32 w	=	0,n	=	0;
	ILI9326.sCS_PORT		=	GPIOB;
	ILI9326.sCS_Pin			=	GPIO_Pin_7;
	
	ILI9326.sRS_PORT		=	GPIOB;
	ILI9326.sRS_Pin			=	GPIO_Pin_6;
	
	ILI9326.sWR_PORT		=	GPIOB;
	ILI9326.sWR_Pin			=	GPIO_Pin_8;
	
	ILI9326.sRD_PORT		=	GPIOB;
	ILI9326.sRD_Pin			=	GPIO_Pin_5;
	
	ILI9326.sREST_PORT	=	GPIOB;
	ILI9326.sREST_Pin		=	GPIO_Pin_9;
	
	ILI9326.sBL_PORT		=	GPIOB;
	ILI9326.sBL_Pin			=	GPIO_Pin_0;
	
	ILI9326.sTE_PORT		=	GPIOB;
	ILI9326.sTE_Pin			=	GPIO_Pin_4;
	
	ILI9326.sDATABUS_PORT	=	GPIOC;
	ILI9326.sDATABUS_Pin	=	GPIO_Pin_All;
	
	ILI9326_Initialize(&ILI9326);
	
	ILI9326_Delay(LCDTime);
//	w	=	12345678;
//	PL010V13_PrintfString(0		,0	,16	,"%8d",w);				//待发药槽位，后边的省略号就是可变参数
//	w	+=	1;n	+=	8;
//	PL010V13_PrintfString(n		,0	,16	,"%2d",w);				//待发药槽位，后边的省略号就是可变参数
//	w	+=	1;n	+=	8;
//	PL010V13_PrintfString(n		,0	,16	,"%2d",w);				//待发药槽位，后边的省略号就是可变参数
//	w	+=	1;n	+=	8;
//	PL010V13_PrintfString(n		,0	,16	,"%2d",w);				//待发药槽位，后边的省略号就是可变参数
//	w	+=	1;n	+=	8;
//	PL010V13_PrintfString(n		,0	,16	,"%2d",w);				//待发药槽位，后边的省略号就是可变参数
//	w	+=	1;n	+=	8;
//	PL010V13_PrintfString(n		,0	,16	,"%2d",w);				//待发药槽位，后边的省略号就是可变参数
//	w	+=	1;n	+=	8;
//	PL010V13_PrintfString(n		,0	,16	,"%2d",w);				//待发药槽位，后边的省略号就是可变参数
//	w	+=	1;n	+=	8;
//	PL010V13_PrintfString(n		,0	,16	,"%2d",w);				//待发药槽位，后边的省略号就是可变参数

//	R61509V_Clean(0X01CF);			//清除屏幕函数--黄色
//	R61509V_Delay(LCDTime);
//	
//	R61509V_Clean(0X07FF);			//清除屏幕函数--红色
//	R61509V_Delay(LCDTime);
//	
//	R61509V_Clean(0x07E0);			//清除屏幕函数--紫色
//	R61509V_Delay(LCDTime);
//	
//	R61509V_Clean(0XFC07);			//清除屏幕函数--蓝色
//	R61509V_Delay(LCDTime);
//	
//	R61509V_Clean(0xF800);			//清除屏幕函数--蓝白
//	R61509V_Delay(LCDTime);

//	R61509V_Clean(R61509V_BLACK);			//清除屏幕函数------
//	R61509V_Delay(LCDTime);
#endif
#ifdef	USE_ILI9326
	
	unsigned long	LCDTime	=	0xFFFFFF;
	u32 w	=	0,n	=	0;
	sLCD.sPort.sCS_PORT		=	GPIOB;
	sLCD.sPort.sCS_Pin			=	GPIO_Pin_7;
	
	sLCD.sPort.sRS_PORT		=	GPIOB;
	sLCD.sPort.sRS_Pin			=	GPIO_Pin_6;
	
	sLCD.sPort.sWR_PORT		=	GPIOB;
	sLCD.sPort.sWR_Pin			=	GPIO_Pin_8;
	
	sLCD.sPort.sRD_PORT		=	GPIOB;
	sLCD.sPort.sRD_Pin			=	GPIO_Pin_5;
	
	sLCD.sPort.sREST_PORT	=	GPIOB;
	sLCD.sPort.sREST_Pin		=	GPIO_Pin_9;
	
	sLCD.sPort.sBL_PORT		=	GPIOB;
	sLCD.sPort.sBL_Pin			=	GPIO_Pin_0;
	
	sLCD.sPort.sTE_PORT		=	GPIOB;
	sLCD.sPort.sTE_Pin			=	GPIO_Pin_4;
	
